/*Посчитайте количество товаров в каждом заказе, примените к этим значениям группировку и рассчитайте количество заказов в каждой группе. Учитывайте только заказы, оформленные по будням. В результат включите только те размеры заказов, общее число которых превышает 2000. Для расчётов используйте данные из таблицы orders.

Выведите две колонки: размер заказа и число заказов такого размера. Колонки назовите соответственно order_size и orders_count.

Результат отсортируйте по возрастанию размера заказа.

Поля в результирующей таблице: order_size, orders_count*/

SELECT count(order_id) as orders_count,
       array_length(product_ids, 1) as order_size
FROM   orders
WHERE  date_part('isodow', creation_time) in (1, 2, 3, 4, 5)
GROUP BY order_size having count(order_id) > 2000
ORDER BY order_size